RT-Thread/rt-thread/bsp/gd32/arm/libraries/GD32H7xx_Firmware_Library/GD32H7xx_standard_peripheral/Source/gd32h7xx_sdio.c
/*!
    \brief      get the flags state of SDIO
    \param[in]  sdio_periph: SDIOx(x=0,1)
    \param[in]  flag: flags state of SDIO
                one or more parameters can be selected which are shown as below:
      \arg        SDIO_FLAG_CCRCERR: command response received (CRC check failed) flag
      \arg        SDIO_FLAG_DTCRCERR: data block sent/received (CRC check failed) flag
      \arg        SDIO_FLAG_CMDTMOUT: command response timeout flag
      \arg        SDIO_FLAG_DTTMOUT: data timeout flag
      \arg        SDIO_FLAG_TXURE: transmit FIFO underrun error occurs flag
      \arg        SDIO_FLAG_RXORE: received FIFO overrun error occurs flag
      \arg        SDIO_FLAG_CMDRECV: command response received (CRC check passed) flag
      \arg        SDIO_FLAG_CMDSEND: command sent (no response required) flag
      \arg        SDIO_FLAG_DTEND: data end (data counter, SDIO_DATACNT, is zero) flag
      \arg        SDIO_FLAG_DTHOLD: data transfer hold flag
      \arg        SDIO_FLAG_DTBLKEND: data block sent/received (CRC check passed) flag
      \arg        SDIO_FLAG_DTABORT: data transfer aborted by CMD12 flag
      \arg        SDIO_FLAG_CMDSTA: command path active state flag
      \arg        SDIO_FLAG_DATSTA: data path active state flag
      \arg        SDIO_FLAG_TFH: transmit FIFO is half empty flag: at least 8 words can be written into the FIFO
      \arg        SDIO_FLAG_RFH: receive FIFO is half full flag: at least 8 words can be read in the FIFO
      \arg        SDIO_FLAG_TFF: transmit FIFO is full flag
      \arg        SDIO_FLAG_RFF: receive FIFO is full flag
      \arg        SDIO_FLAG_TFE: transmit FIFO is empty flag
      \arg        SDIO_FLAG_RFE: receive FIFO is empty flag
      \arg        SDIO_FLAG_DAT0BSY: DAT0 line signal keep busy flag
      \arg        SDIO_FLAG_DAT0BSYEND: DAT0 line signal changed form busy to ready flag
      \arg        SDIO_FLAG_SDIOINT: SD I/O interrupt received flag
      \arg        SDIO_FLAG_ACKFAIL: boot acknowledgment received and check fail flag
      \arg        SDIO_FLAG_ACKTO: boot acknowledgment timeout flag
      \arg        SDIO_FLAG_VOLSWEND: voltage switch critical timing section end
      \arg        SDIO_FLAG_CLKSTOP: SDIO_CLK stopped in voltage switch procedure flag
      \arg        SDIO_FLAG_IDMAERR: IDMA transfer error flag
      \arg        SDIO_FLAG_IDMAEND: IDMA transfer end flag
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus sdio_flag_get(uint32_t sdio_periph, uint32_t flag)
{
    FlagStatus temp_flag = RESET;
    if(RESET != (SDIO_STAT(sdio_periph) & flag)) {
        temp_flag = SET;
    }
    return temp_flag;
}

/*!
    \brief      clear the pending flags of SDIO
    \param[in]  sdio_periph: SDIOx(x=0,1)
    \param[in]  flag: flags state of SDIO
                one or more parameters can be selected which are shown as below:
      \arg        SDIO_FLAG_CCRCERR: command response received (CRC check failed) flag
      \arg        SDIO_FLAG_DTCRCERR: data block sent/received (CRC check failed) flag
      \arg        SDIO_FLAG_CMDTMOUT: command response timeout flag
      \arg        SDIO_FLAG_DTTMOUT: data timeout flag
      \arg        SDIO_FLAG_TXURE: transmit FIFO underrun error occurs flag
      \arg        SDIO_FLAG_RXORE: received FIFO overrun error occurs flag
      \arg        SDIO_FLAG_CMDRECV: command response received (CRC check passed) flag
      \arg        SDIO_FLAG_CMDSEND: command sent (no response required) flag
      \arg        SDIO_FLAG_DTEND: data end (data counter, SDIO_DATACNT, is zero) flag
      \arg        SDIO_FLAG_DTHOLD: data transfer hold flag
      \arg        SDIO_FLAG_DTBLKEND: data block sent/received (CRC check passed) flag
      \arg        SDIO_FLAG_DTABORT: data transfer aborted (by CMD12) flag
      \arg        SDIO_FLAG_DAT0BSYEND: DAT0 line signal changed form busy to ready flag
      \arg        SDIO_FLAG_SDIOINT: SD I/O interrupt received flag
      \arg        SDIO_FLAG_ACKFAIL: boot acknowledgment received and check fail
      \arg        SDIO_FLAG_ACKTO: boot acknowledgment timeout flag
      \arg        SDIO_FLAG_VOLSWEND: voltage switch critical timing section end flag
      \arg        SDIO_FLAG_CLKSTOP: SDIO_CLK stopped in voltage switch procedure flag
      \arg        SDIO_FLAG_IDMAERR: IDMA transfer error occurs flag
      \arg        SDIO_FLAG_IDMAEND: IDMA transfer end flag
    \param[out] none
    \retval     none
*/
void sdio_flag_clear(uint32_t sdio_periph, uint32_t flag)
{
    SDIO_INTC(sdio_periph) = flag;
}

/*!
    \brief      enable the SDIO interrupt
    \param[in]  sdio_periph: SDIOx(x=0,1)
    \param[in]  int_flag: interrupt flags state of SDIO
                one or more parameters can be selected which are shown as below:
      \arg        SDIO_INT_CCRCERR: SDIO CCRCERR interrupt
      \arg        SDIO_INT_DTCRCERR: SDIO DTCRCERR interrupt
      \arg        SDIO_INT_CMDTMOUT: SDIO CMDTMOUT interrupt
      \arg        SDIO_INT_DTTMOUT: SDIO DTTMOUT interrupt
      \arg        SDIO_INT_TXURE: SDIO TXURE interrupt
      \arg        SDIO_INT_RXORE: SDIO RXORE interrupt
      \arg        SDIO_INT_CMDRECV: SDIO CMDRECV interrupt
      \arg        SDIO_INT_CMDSEND: SDIO CMDSEND interrupt
      \arg        SDIO_INT_DTEND: SDIO DTEND interrupt
      \arg        SDIO_INT_DTHOLD: SDIO DTHOLD interrupt
      \arg        SDIO_INT_DTBLKEND: SDIO DTBLKEND interrupt
      \arg        SDIO_INT_DTABORT: SDIO DTABORT interrupt
      \arg        SDIO_INT_TFH: SDIO TFH interrupt
      \arg        SDIO_INT_RFH: SDIO RFH interrupt
      \arg        SDIO_INT_RFF: SDIO RFF interrupt
      \arg        SDIO_INT_TFE: SDIO TFE interrupt
      \arg        SDIO_INT_DAT0BSYEND: SDIO DAT0BSYEND interrupt
      \arg        SDIO_INT_SDIOINT: SDIO SDIOINT interrupt
      \arg        SDIO_INT_ACKFAIL: SDIO ACKFAIL interrupt
      \arg        SDIO_INT_ACKTO: SDIO ACKTO interrupt
      \arg        SDIO_INT_VOLSWEND: SDIO VOLSWEND interrupt
      \arg        SDIO_INT_CLKSTOP: SDIO CLKSTOP interrupt
      \arg        SDIO_INT_IDMAERR: SDIO IDMAERR interrupt
      \arg        SDIO_INT_IDMAEND: SDIO IDMAEND interrupt
    \param[out] none
    \retval     none
*/
void sdio_interrupt_enable(uint32_t sdio_periph, uint32_t int_flag)
{
    SDIO_INTEN(sdio_periph) |= int_flag;
}

/*!
    \brief      enable the SDIO interrupt
    \param[in]  sdio_periph: SDIOx(x=0,1)
    \param[in]  int_flag: interrupt flags state of SDIO
                one or more parameters can be selected which are shown as below:
      \arg        SDIO_INT_CCRCERR: SDIO CCRCERR interrupt
      \arg        SDIO_INT_DTCRCERR: SDIO DTCRCERR interrupt
      \arg        SDIO_INT_CMDTMOUT: SDIO CMDTMOUT interrupt
      \arg        SDIO_INT_DTTMOUT: SDIO DTTMOUT interrupt
      \arg        SDIO_INT_TXURE: SDIO TXURE interrupt
      \arg        SDIO_INT_RXORE: SDIO RXORE interrupt
      \arg        SDIO_INT_CMDRECV: SDIO CMDRECV interrupt
      \arg        SDIO_INT_CMDSEND: SDIO CMDSEND interrupt
      \arg        SDIO_INT_DTEND: SDIO DTEND interrupt
      \arg        SDIO_INT_DTHOLD: SDIO DTHOLD interrupt
      \arg        SDIO_INT_DTBLKEND: SDIO DTBLKEND interrupt
      \arg        SDIO_INT_DTABORT: SDIO DTABORT interrupt
      \arg        SDIO_INT_TFH: SDIO TFH interrupt
      \arg        SDIO_INT_RFH: SDIO RFH interrupt
      \arg        SDIO_INT_RFF: SDIO RFF interrupt
      \arg        SDIO_INT_TFE: SDIO TFE interrupt
      \arg        SDIO_INT_DAT0BSYEND: SDIO DAT0BSYEND interrupt
      \arg        SDIO_INT_SDIOINT: SDIO SDIOINT interrupt
      \arg        SDIO_INT_ACKFAIL: SDIO ACKFAIL interrupt
      \arg        SDIO_INT_ACKTO: SDIO ACKTO interrupt
      \arg        SDIO_INT_VOLSWEND: SDIO VOLSWEND interrupt
      \arg        SDIO_INT_CLKSTOP: SDIO CLKSTOP interrupt
      \arg        SDIO_INT_IDMAERR: SDIO IDMAERR interrupt
      \arg        SDIO_INT_IDMAEND: SDIO IDMAEND interrupt
    \param[out] none
    \retval     none
*/
void sdio_interrupt_disable(uint32_t sdio_periph, uint32_t int_flag)
{
    SDIO_INTEN(sdio_periph) &= ~int_flag;
}

/*!
    \brief      get the interrupt flags state of SDIO
    \param[in]  sdio_periph: SDIOx(x=0,1)
    \param[in]  int_flag: interrupt flags state of SDIO
                one or more parameters can be selected which are shown as below:
      \arg        SDIO_INT_FLAG_CCRCERR: SDIO CCRCERR interrupt flag
      \arg        SDIO_INT_FLAG_DTCRCERR: SDIO DTCRCERR interrupt flag
      \arg        SDIO_INT_FLAG_CMDTMOUT: SDIO CMDTMOUT interrupt flag
      \arg        SDIO_INT_FLAG_DTTMOUT: SDIO DTTMOUT interrupt flag
      \arg        SDIO_INT_FLAG_TXURE: SDIO TXURE interrupt flag
      \arg        SDIO_INT_FLAG_RXORE: SDIO RXORE interrupt flag
      \arg        SDIO_INT_FLAG_CMDRECV: SDIO CMDRECV interrupt flag
      \arg        SDIO_INT_FLAG_CMDSEND: SDIO CMDSEND interrupt flag
      \arg        SDIO_INT_FLAG_DTEND: SDIO DTEND interrupt flag
      \arg        SDIO_INT_FLAG_DTHOLD: SDIO DTHOLD interrupt flag
      \arg        SDIO_INT_FLAG_DTBLKEND: SDIO DTBLKEND interrupt flag
      \arg        SDIO_INT_FLAG_DTABORT: SDIO DTABORT interrupt flag
      \arg        SDIO_INT_FLAG_TFH: SDIO TFH interrupt flag
      \arg        SDIO_INT_FLAG_RFH: SDIO RFH interrupt flag
      \arg        SDIO_INT_FLAG_RFF: SDIO RFF interrupt flag
      \arg        SDIO_INT_FLAG_TFE: SDIO TFE interrupt flag
      \arg        SDIO_INT_FLAG_DAT0BSYEND: SDIO DAT0BSYEND interrupt flag
      \arg        SDIO_INT_FLAG_SDIOINT: SDIO SDIOINT interrupt flag
      \arg        SDIO_INT_FLAG_ACKFAIL: SDIO ACKFAIL interrupt flag
      \arg        SDIO_INT_FLAG_ACKTO: SDIO ACKTO interrupt flag
      \arg        SDIO_INT_FLAG_VOLSWEND: SDIO VOLSWEND interrupt flag
      \arg        SDIO_INT_FLAG_CLKSTOP: SDIO CLKSTOP interrupt flag
      \arg        SDIO_INT_FLAG_IDMAERR: SDIO IDMAERR interrupt flag
      \arg        SDIO_INT_FLAG_IDMAEND: SDIO IDMAEND interrupt flag
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus sdio_interrupt_flag_get(uint32_t sdio_periph, uint32_t int_flag)
{
    FlagStatus temp_flag = RESET;
    if(RESET != (SDIO_STAT(sdio_periph) & int_flag)) {
        temp_flag = SET;
    }
    return temp_flag;
}

/*!
    \brief      clear the interrupt pending flags of SDIO
    \param[in]  sdio_periph: SDIOx(x=0,1)
    \param[in]  int_flag: interrupt flags state of SDIO
                one or more parameters can be selected which are shown as below:
      \arg        SDIO_INT_FLAG_CCRCERR: SDIO CCRCERR interrupt flag
      \arg        SDIO_INT_FLAG_DTCRCERR: SDIO DTCRCERR interrupt flag
      \arg        SDIO_INT_FLAG_CMDTMOUT: SDIO CMDTMOUT interrupt flag
      \arg        SDIO_INT_FLAG_DTTMOUT: SDIO DTTMOUT interrupt flag
      \arg        SDIO_INT_FLAG_TXURE: SDIO TXURE interrupt flag
      \arg        SDIO_INT_FLAG_RXORE: SDIO RXORE interrupt flag
      \arg        SDIO_INT_FLAG_CMDRECV: SDIO CMDRECV interrupt flag
      \arg        SDIO_INT_FLAG_CMDSEND: SDIO CMDSEND interrupt flag
      \arg        SDIO_INT_FLAG_DTEND: SDIO DTEND interrupt flag
      \arg        SDIO_INT_FLAG_DTHOLD: SDIO DTHOLD interrupt flag
      \arg        SDIO_INT_FLAG_DTBLKEND: SDIO DTBLKEND interrupt flag
      \arg        SDIO_INT_FLAG_DTABORT: SDIO DTABORT interrupt flag
      \arg        SDIO_INT_FLAG_DAT0BSYEND: SDIO DAT0BSYEND interrupt flag
      \arg        SDIO_INT_FLAG_SDIOINT: SDIO SDIOINT interrupt flag
      \arg        SDIO_INT_FLAG_ACKFAIL: SDIO ACKFAIL interrupt flag
      \arg        SDIO_INT_FLAG_ACKTO: SDIO ACKTO interrupt flag
      \arg        SDIO_INT_FLAG_VOLSWEND: SDIO VOLSWEND interrupt flag
      \arg        SDIO_INT_FLAG_CLKSTOP: SDIO CLKSTOP interrupt flag
      \arg        SDIO_INT_FLAG_IDMAERR: SDIO IDMAERR interrupt flag
      \arg        SDIO_INT_FLAG_IDMAEND: SDIO IDMAEND interrupt flag
    \param[out] none
    \retval     none
*/
void sdio_interrupt_flag_clear(uint32_t sdio_periph, uint32_t int_flag)
{
    SDIO_INTC(sdio_periph) = int_flag;
}

/*!
    \brief      enable voltage switch
    \param[in]  sdio_periph: SDIOx(x=0,1)
    \param[out] none
    \retval     none
*/
void sdio_voltage_switch_enable(uint32_t sdio_periph)
{
    SDIO_PWRCTL(sdio_periph) |= SDIO_PWRCTL_VSEN;
}

/*!
    \brief      disable voltage switch
    \param[in]  sdio_periph: SDIOx(x=0,1)
    \param[out] none
    \retval     none
*/
void sdio_voltage_switch_disable(uint32_t sdio_periph)
{
    SDIO_PWRCTL(sdio_periph) &= ~SDIO_PWRCTL_VSEN;
}

/*!
    \brief      enable voltage switch sequence
    \param[in]  sdio_periph: SDIOx(x=0,1)
    \param[out] none
    \retval     none
*/
void sdio_voltage_switch_sequence_enable(uint32_t sdio_periph)
{
    SDIO_PWRCTL(sdio_periph) |= SDIO_PWRCTL_VSSTART;
}

/*!
    \brief      disable voltage switch sequence
    \param[in]  sdio_periph: SDIOx(x=0,1)
    \param[out] none
    \retval     none
*/
void sdio_voltage_switch_sequence_disable(uint32_t sdio_periph)
{
    SDIO_PWRCTL(sdio_periph) &= ~SDIO_PWRCTL_VSSTART;
}

/*!
    \brief      set boot mode
    \param[in]  sdio_periph: SDIOx(x=0,1)
    \param[in]  boot_mode: mode of SDIO boot
                only one parameter can be selected which is shown as below:
      \arg        SDIO_BOOTMODE_NORMAL: normal boot mode
      \arg        SDIO_BOOTMODE_ALTERNATIVE: alternative boot mode
    \param[out] none
    \retval     none
*/
void sdio_boot_mode_set(uint32_t sdio_periph, uint32_t boot_mode)
{
    /* reset boot mode selection bit */
    SDIO_CMDCTL(sdio_periph) &= ~SDIO_CMDCTL_BOOTMOD;
    /* set boot mode according to the boot_mode */
    SDIO_CMDCTL(sdio_periph) |= boot_mode;
}

/*!
    \brief      enbale DSM(data state machine) boot acknowledgment
    \param[in]  sdio_periph: SDIOx(x=0,1)
    \param[out] none
    \retval     none
*/
void sdio_boot_ack_enable(uint32_t sdio_periph)
{
    SDIO_DATACTL(sdio_periph) |= SDIO_DATACTL_ACKEN;
}

/*!
    \brief      disbale DSM(data state machine) boot acknowledgment
    \param[in]  sdio_periph: SDIOx(x=0,1)
    \param[out] none
    \retval     none
*/
void sdio_boot_ack_disable(uint32_t sdio_periph)
{
    SDIO_DATACTL(sdio_periph) &= ~SDIO_DATACTL_ACKEN;
}

/*!
    \brief      set boot ACK timeout period
    \param[in]  sdio_periph: SDIOx(x=0,1)
    \param[in]  timeout: boot ACK timeout period
    \param[out] none
    \retval     none
*/
void sdio_boot_acktimeout_set(uint32_t sdio_periph, uint32_t timeout)
{
    SDIO_ACKTO(sdio_periph) &= ~SDIO_ACKTO_ACKTO;
    SDIO_ACKTO(sdio_periph) |= timeout & SDIO_ACKTO_ACKTO;
}

/*!
    \brief      enable boot operation
    \param[in]  sdio_periph: SDIOx(x=0,1)
    \param[out] none
    \retval     none
*/
void sdio_boot_enable(uint32_t sdio_periph)
{
    SDIO_CMDCTL(sdio_periph) |= SDIO_CMDCTL_BOOTMODEN;
}

/*!
    \brief      disable boot operation
    \param[in]  sdio_periph: SDIOx(x=0,1)
    \param[out] none
    \retval     none
*/
void sdio_boot_disable(uint32_t sdio_periph)
{
    SDIO_CMDCTL(sdio_periph) &= ~SDIO_CMDCTL_BOOTMODEN;
}
